---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovedFromDocumentEventArgs
source: html/41482bb2-09b7-be72-fe6a-b3e616922505.htm
---
# ExternalDataInstanceRemovedFromDocumentEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.